
#__version__= pyfiglet.print_figlet("vBETA",font="big")

intro_header= '''
██╗░░██╗███╗░░██╗██╗░█████╗░██╗░░██╗  ░█████╗░░██████╗░██████╗██╗░██████╗████████╗░█████╗░███╗░░██╗████████╗
██║░██╔╝████╗░██║██║██╔══██╗██║░██╔╝  ██╔══██╗██╔════╝██╔════╝██║██╔════╝╚══██╔══╝██╔══██╗████╗░██║╚══██╔══╝
█████═╝░██╔██╗██║██║██║░░╚═╝█████═╝░  ███████║╚█████╗░╚█████╗░██║╚█████╗░░░░██║░░░███████║██╔██╗██║░░░██║░░░
██╔═██╗░██║╚████║██║██║░░██╗██╔═██╗░  ██╔══██║░╚═══██╗░╚═══██╗██║░╚═══██╗░░░██║░░░██╔══██║██║╚████║░░░██║░░░
██║░╚██╗██║░╚███║██║╚█████╔╝██║░╚██╗  ██║░░██║██████╔╝██████╔╝██║██████╔╝░░░██║░░░██║░░██║██║░╚███║░░░██║░░░
╚═╝░░╚═╝╚═╝░░╚══╝╚═╝░╚════╝░╚═╝░░╚═╝  ╚═╝░░╚═╝╚═════╝░╚═════╝░╚═╝╚═════╝░░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░'''

assistant_pause='''
▄▀█ █▀ █▀ █ █▀ ▀█▀ ▄▀█ █▄░█ ▀█▀   █▀█ ▄▀█ █░█ █▀ █▀▀ █▀▄
█▀█ ▄█ ▄█ █ ▄█ ░█░ █▀█ █░▀█ ░█░   █▀▀ █▀█ █▄█ ▄█ ██▄ █▄▀'''

assistant_resumed='''
▄▀█ █▀ █▀ █ █▀ ▀█▀ ▄▀█ █▄░█ ▀█▀   █▀█ █▀▀ █▀ █░█ █▀▄▀█ █▀▀ █▀▄
█▀█ ▄█ ▄█ █ ▄█ ░█░ █▀█ █░▀█ ░█░   █▀▄ ██▄ ▄█ █▄█ █░▀░█ ██▄ █▄▀'''

command_list=('''
               Utility commands:
                  ★ open (whatsapp,google,Edge,youtube,gmail,github,disocrd,instagram,facebook,stackoverflow)
    *To be Added: ★ close (whatsapp,google,Edge,youtube,gmail,github,disocrd,instagram,facebook,stackoverflow) 
                  ★ open youtube and search for
                  ★ open my inbox
                  ★ open sent mails
                  ★ open terminal
                  ★ open Snipping Tool
                  ★ Take ScreenShot
                  ★ text to handwriting
                  ★ image to ascii
                  ★ clear Cache
                  ★ empty recycle bin
                  ★ Open CMD/Terminal
                  ★ log off/sign out
                  ★ restart my pc
                  ★ Shutdown
                  ★ date today
                  ★ note/remember this


                                                   Explore Commands:
                                                   🟂 tell weather
                                                   🟂 tell time
                                                   🟂 tell date
                                                   🟂 tell news
                                                   🟂 who is   (Person)
                                                   🟂 where is (location)
                                                   🟂 search on google  (for anything on your browser)
                                                   🟂 ask (computational/geographical questions)
                                                   🟂 wikipedia (search all the wikipedia for your Query)
                                                   🟂 where is (for finding locations on google Maps)


               Content Creator Commands:
                  ‣ yt studio (opens youtube studio)
                  ‣ live studio (opens youtube live dashboard)
                  ‣ keywords (opne google trends)
                  ‣ viewbot (opens livestream viewbot)
                  ‣ Suggest Some Good Youtube Practices
                           
                            
                                                   Chattings Commands:
                                                   ☎ Lets Chat
                                                   ☎ Lets Play Games (opens the game Manager)
                                                   ☎ Tell me a joke
                                                   ☎ Insult Me
                                                   ☎ Say/pronounce (make the bot say anything by using this command)
                            

               About Commands:
                  ❆ how were you born/why were you born
                  ❆ who are you / what can you do
                  ❆ what is your name
                  ❆ who created you
                  ❆ what is your slogan
                  ❆ knick website

                                                   Bot Commands:
                                                   ~ change input Mode
                                                   ~ Bye (to Exit the assistant)
                                                   ~ Pause (Pauses the Bot)
                                                   ~ sleep/hibernate (bot works in background)
                                                   ~ support assistance (support service)

            ''')



heart_ascii=('''
                        ____*##########*
                        __*##############
                        __################
                        _##################_________*####*
                        __##################_____*##########
                        __##################___*#############
                        ___#################*_###############*
                        ____#################################*
                        ______###############################
                        _______#############################
                        ________=##########################
                        __________########################
                        ___________*#####################
                        ____________*##################
                        _____________*###############
                        _______________#############
                        ________________##########
                        ________________=#######*
                        _________________######
                        __________________####
                        __________________###
                        ___________________#
''') #i really don't remember if i used this anywhere?   (LE ME- Thinking WHY the hell I even added it?)

smile_face= "(❛ʖ͡❛)"
crywithsmile_face="( ͡ಥʖ͡ಥ)"
people_faces="(⊙.⊙(☉̃ₒ☉)⊙.⊙)"
wtf_face="(ㆆ_ㆆ)"
smile2_face="(̶◉͛‿◉̶)"
temperature_scale_f="℉"
temperature_scale_c="℃"

bug=('''
     .--.       .--.
    _  `    \     /    `  _
     `\.===. \.^./ .===./`
            \/`"`\/
         ,  | BUG |  ,
        / `\|;-.-'|/` .
       /    |::\  |    .
    .-' ,-'`|:::; |`'-, '-.
        |   |::::\|   | 
        |   |::::;|   |
        |   \:::://   |
        |    `.://'   |
       .'             `.
    _,'                 `,_''') #now this is some pro - programmer shit XD 



